// Задача 10. Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа
Console.WriteLine("Input your XX number plz");
System.Console.WriteLine(Convert.ToInt32(Console.ReadLine()) / 10);